status/2021/12mar21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>06 March 2021 - 12 March 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">06 March 2021 - 12 March 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org83900c4">1. Santa Cruz Weather Station</a></li>
<li><a href="#org872f498">2. EPICS</a></li>
<li><a href="#org11c8398">3. Brini Tracker II</a></li>
<li><a href="#orgc7bcac1">4. Perseverance mapping</a></li>
<li><a href="#orgcffc7fe">5. CA-R</a></li>
<li><a href="#org7cbeb06">6. Looks Interesting</a>
<ul>
<li><a href="#org6189e81">6.1. Musicologica Austriaca - Journal for Austrian Music Studies</a></li>
</ul>
</li>
<li><a href="#org0d6ba7d">7. wktplot</a>
<ul>
<li><a href="#org534bb95">7.1. wktrand: Create random points</a></li>
<li><a href="#org57db891">7.2. wktdel: Create Delaunay Triangulation from WKT input</a></li>
<li><a href="#org0263746">7.3. wktvor: Create Voronoi Tessellation from WKT input</a></li>
</ul>
</li>
<li><a href="#org984bf6a">8. porch post</a></li>
<li><a href="#org6938b80">9. Paleogeography</a></li>
</ul>
</div>
</div>
<p>
Forestalling Minor Disasters
</p>

<div id="outline-container-org83900c4" class="outline-2">
<h2 id="org83900c4"><span class="section-number-2">1.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-1">
<p>
Mast sensors still broken
</p>
</div>
</div>
<div id="outline-container-org872f498" class="outline-2">
<h2 id="org872f498"><span class="section-number-2">2.</span> EPICS</h2>
<div class="outline-text-2" id="text-2">
<p>
Test cases covering most of the SCPI commands so-far implemented.
</p>

<p>
Adding functions to parse configuration and calibration memory blocks to u3a.
</p>

<p>
Adding configuration memory interface to u3s.
</p>

<p>
Implementing '*RST' SCPI reset.
</p>
</div>
</div>

<div id="outline-container-org11c8398" class="outline-2">
<h2 id="org11c8398"><span class="section-number-2">3.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-3">
<p>
Buttons still work after eight weeks week of runtime. GPS display update
seems to be intermittent as it is not working at this moment. But the date
<b>is</b> correct.
</p>
</div>
</div>

<div id="outline-container-orgc7bcac1" class="outline-2">
<h2 id="orgc7bcac1"><span class="section-number-2">4.</span> Perseverance mapping</h2>
<div class="outline-text-2" id="text-4">
<p>
Still thinking on next steps.
</p>
</div>
</div>

<div id="outline-container-orgcffc7fe" class="outline-2">
<h2 id="orgcffc7fe"><span class="section-number-2">5.</span> CA-R</h2>
<div class="outline-text-2" id="text-5">
<p>
Noticed that the population numbers in the county popup were wrong, see
</p>

<p>
<a href="https://github.com/daniel-kelley/ca-r/issues/13">https://github.com/daniel-kelley/ca-r/issues/13</a>
</p>

<p>
This was because the columns moved around. Because of the way the
columns were constructed, it wasn't obvious how to use the columns
names as a key.  Now column lookup uses a regexp ("two problems"
nonwithstanding, see
</p>

<p>
<a href="https://softwareengineering.stackexchange.com/questions/223634/what-is-meant-by-now-you-have-two-problems">https://softwareengineering.stackexchange.com/questions/223634/what-is-meant-by-now-you-have-two-problems</a>)
</p>

<p>
and only look up the needed columns so as to not break on unneeded
data.
</p>

<p>
This morning, I am getting "500 Internal Server Error" when 'wget'ting the
data; looking at the web page I see
</p>

<p>
COVID-19 Cases - Deprecated
</p>

<p>
This dataset has been replaced with an update that can be found here:
</p>

<p>
<a href="https://data.chhs.ca.gov/dataset/covid-19-time-series-metrics-by-county-and-state">https://data.chhs.ca.gov/dataset/covid-19-time-series-metrics-by-county-and-state</a>
</p>

<p>
Looks I'll be having a fun morning.
</p>
</div>
</div>

<div id="outline-container-org7cbeb06" class="outline-2">
<h2 id="org7cbeb06"><span class="section-number-2">6.</span> Looks Interesting</h2>
<div class="outline-text-2" id="text-6">
<p>
Reorganized top level pages: <a href="http://gmp.san-jose.ca.us/~dkelley/journal/">http://gmp.san-jose.ca.us/~dkelley/journal/</a>
</p>
</div>

<div id="outline-container-org6189e81" class="outline-3">
<h3 id="org6189e81"><span class="section-number-3">6.1.</span> Musicologica Austriaca - Journal for Austrian Music Studies</h3>
<div class="outline-text-3" id="text-6-1">
<p>
<a href="http://www.musau.org/">http://www.musau.org/</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org0d6ba7d" class="outline-2">
<h2 id="org0d6ba7d"><span class="section-number-2">7.</span> wktplot</h2>
<div class="outline-text-2" id="text-7">
<p>
Gave wktplot something to do:
</p>
</div>

<div id="outline-container-org534bb95" class="outline-3">
<h3 id="org534bb95"><span class="section-number-3">7.1.</span> wktrand: Create random points</h3>
</div>
<div id="outline-container-org57db891" class="outline-3">
<h3 id="org57db891"><span class="section-number-3">7.2.</span> wktdel: Create Delaunay Triangulation from WKT input</h3>
</div>
<div id="outline-container-org0263746" class="outline-3">
<h3 id="org0263746"><span class="section-number-3">7.3.</span> wktvor: Create Voronoi Tessellation from WKT input</h3>
</div>
</div>

<div id="outline-container-org984bf6a" class="outline-2">
<h2 id="org984bf6a"><span class="section-number-2">8.</span> porch post</h2>
<div class="outline-text-2" id="text-8">
<p>
Installed a "temporary" post at my Mom's house to support a failing
beam over the front porch.
</p>
</div>
</div>

<div id="outline-container-org6938b80" class="outline-2">
<h2 id="org6938b80"><span class="section-number-2">9.</span> Paleogeography</h2>
<div class="outline-text-2" id="text-9">
<p>
Potential new distraction:
</p>

<p>
<a href="https://www.earthbyte.org/category/resources/data-models/paleogeography/">https://www.earthbyte.org/category/resources/data-models/paleogeography/</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
